<html><head><title></title></head>
<body bgcolor=#ffffff>
 
<a name="36">
<img src="us.gif">
Copyright 1996 Sun Microsystems, Inc., 2550 Garcia Avenue, Mountain View, California 94043-1100 U.S.A. All rights reserved.<p>
</a>
<a name="55">
This product or document is protected by copyright and distributed under licenses restricting its use, copying, distribution, and decompilation. No part of this product or document may be reproduced in any form by any means without prior written authorization of Sun and its licensors, if any.<p>
</a>
<a name="56">
Portions of this product may be derived from the UNIX<sup>&#174;</sup> system, licensed from Novell, Inc., and from the Berkeley 4.3 BSD system, licensed from the University of California. UNIX is a registered trademark in the United States and other countries and is exclusively licensed by X/Open Company Ltd. Third-party software, including font technology in this product, is protected by copyright and licensed from Sun&#39;s suppliers.<p>
</a>
<a name="57">
RESTRICTED RIGHTS:  Use, duplication, or disclosure by the U.S. Government is subject to restrictions of FAR 52.227-14(g)(2)(6/87) and FAR 52.227-19(6/87), or DFAR 252.227-7015(b)(6/95) and DFAR 227.7202-3(a).<p>
</a>
<a name="176">
Sun, Sun Microsystems, the Sun logo, SunSoft, Solaris, the SunSoft logo, SunOS, Sun WorkShop, Sun Performance WorkShop, Sun Performance Library, Sun Visual WorkShop, Sun WorkShop TeamWare, Sun FORTRAN, AnswerBook, Sun-4, ONC, ONC+, NFS, OpenWindows, DeskSet, ToolTalk, SunView, XView, X11/NeWS, Magnify Help, ScholarPASS, GoldPass, SunExpress, Java, Java WorkShop, Joe, and NEOworks are trademarks or registered trademarks of Sun Microsystems, Inc. in the United States and other countries. All SPARC trademarks are used under license and are trademarks or registered trademarks of SPARC International, Inc. in the United States and other countries. Products bearing SPARC trademarks are based upon an architecture developed by Sun Microsystems, Inc. PostScript and Display PostScript are trademarks of Adobe Systems, Inc., which may be registered in certain jurisdictions. Netscape is a trademark of Netscape Communications Corporation. <p>
</a>
<a name="59">
The OPEN LOOK<sup>&#174;</sup> and Sun<sup>TM</sup> Graphical User Interfaces were developed by Sun Microsystems, Inc. for its users and licensees. Sun acknowledges the pioneering efforts of Xerox in researching and developing the concept of visual or graphical user interfaces for the computer industry. Sun holds a non-exclusive license from Xerox to the Xerox Graphical User Interface, which license also covers Sun&#39;s licensees who implement OPEN LOOK GUIs and otherwise comply with Sun&#39;s written license agreements.<p>
</a>
<a name="164">
<kbd>f90</kbd> IS DERIVED FROM CRAY CF90<sup>TM</sup>, A PRODUCT OF CRAY RESEARCH, INC.<p>
</a>
<a name="169">
THIS PUBLICATION IS PROVIDED &#34;AS IS&#34; WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.<p>
</a>
<a name="155">
Tools.h++ Class Library Reference and Tools.h++ User&#39;s Guide are Copyright 1996 by Rogue Wave Software, Inc. All rights reserved. Rogue Wave and .h++ are registered trademarks, and Tools.h++ is a trademark, of Rogue Wave Software, Inc.<p>
</a>
<hr noshade><br>
<a name="188">
<img src="fr.gif">
Copyright 1996 Sun Microsystems Inc., 2550 Garcia Avenue, Mountain View, Californie 94043-1100, U.S.A. Tous droits r&eacute;serv&eacute;s.<p>
</a>
<a name="189">
Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; avec des licences qui en restreignent l&#39;utilisation, la copie, la distribution, et la d&eacute;compilation. Aucune partie de ce produit ou de sa documentation associ&eacute;e ne peut &ecirc;tre reproduite sous aucune forme, par quelque moyen que ce soit, sans l&#39;autorisation pr&eacute;alable et &eacute;crite de Sun et de ses bailleurs de licence, s&#39;il y en a.<p>
</a>
<a name="190">
Des parties de ce produit pourront &ecirc;tre d&eacute;riv&eacute;es du syst&egrave;me UNIX<sup>&#174;</sup> licenci&eacute; par Novell, Inc. et du syst&egrave;me Berkeley 4.3 BSD licenci&eacute; par l&#39;Universit&eacute; de Californie. UNIX est une marque enregistr&eacute;e aux Etats-Unis et dans d&#39;autres pays et licenci&eacute;e exclusivement par X/Open Company Ltd. Le logiciel d&eacute;tenu par des tiers, et qui comprend la technologie relative aux polices de caract&egrave;res, est prot&eacute;g&eacute; par un copyright et licenci&eacute; par des fournisseurs de Sun.<p>
</a>
<a name="191">
Sun, Sun Microsystems, le logo Sun, SunSoft, Solaris, le logo SunSoft, SunOS, Sun WorkShop, Sun Performance WorkShop, Sun Performance Library, Sun Visual WorkShop, Sun WorkShop TeamWare, Sun FORTRAN, AnswerBook, Sun-4, ONC, ONC+, NFS, OpenWindows, DeskSet, ToolTalk, SunView, XView, X11/NeWS, Magnify Help, ScholarPASS, GoldPass, SunExpress, Java, Java WorkShop, Joe, et NEOworks sont des marques d&eacute;pos&eacute;es ou enregistr&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d&#39;autres pays. Toutes les marques SPARC, utilis&eacute;es sous licence, sont des marques d&eacute;pos&eacute;es ou enregistr&eacute;es de SPARC International, Inc. aux Etats-Unis et dans d&#39;autres pays. Les produits portant les marques SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc. PostScript et Display PostScript sont des marques d&#39;Adobe Systems, Inc. Netscape est une marque de Netscape Communications Corporation.<p>
</a>
<a name="192">
Les interfaces d&#39;utilisation graphique OPEN LOOK<sup>&#174;</sup> et Sun<sup>TM</sup> ont &eacute;t&eacute; d&eacute;velopp&eacute;es par Sun Microsystems, Inc. pour ses utilisateurs et licenci&eacute;s. Sun reconna&icirc;t les efforts des pionniers de Xerox pour la recherche et le d&eacute;veloppement du concept des interfaces d&#39;utilisation visuelle ou graphique pour l&#39;industrie de l&#39;informatique. Sun d&eacute;tient une licence non exclusive de Xerox sur l&#39;interface d&#39;utilisation graphique Xerox, cette licence couvrant aussi les licenci&eacute;s de Sun qui mettent en place l&#39;interface d&#39;utilisation graphique OPEN LOOK et qui en outre se conforment aux licences &eacute;crites de Sun.<p>
</a>
<a name="193">
<kbd>f90</kbd> est d&eacute;riv&eacute; de Cray CF90<sup>TM</sup>, un produit de Cray Research, Inc.<p>
</a>
<a name="194">
CETTE PUBLICATION EST FOURNIE &#34;EN L&#39;ETAT&#34; SANS GARANTIE D&#39;AUCUNE SORTE, NI EXPRESSE NI IMPLICITE, Y COMPRIS, ET SANS QUE CETTE LISTE NE SOIT LIMITATIVE, DES GARANTIES CONCERNANT LA VALEUR MARCHANDE, L&#39;APTITUDE DES PRODUITS A REPONDRE A UNE UTILISATION PARTICULIERE, OU LE FAIT QU&#39;ILS NE SOIENT PAS CONTREFAISANTS DE PRODUITS DE TIERS.<p>
</a>
<a name="195">
Tools.h++ Class Library Reference et Tools.h++ User&#39;s Guide Copyright 1996 Rogue Wave Software, Inc. Tous droits r&eacute;serv&eacute;s. Rogue Wave et .h++ sont des marques enregistr&eacute;es, et Tools.h++ est une marque de Rogue Wave Software, Inc. <p>
</a>
<a name="156">
<p>
</a>
<a name="61">
<p>
</a>

<hr><br>
 


